import { useParams } from "react-router-dom";

interface ArticleProps {}

const contentStyles = {
  fontFamily: "Arial, sans-serif",
  direction: "rtl",
  lineHeight: "1.6",
  padding: "20px",
  backgroundColor: "#f9f9f9",
  borderRadius: "8px",
  color: "#333",
};

const headingStyles = {
  color: "#444",
};
const firstArticleHTML = (
  <div style={contentStyles}>
    <h2 style={headingStyles}>אתה רוצה להיות מפתח פול-סטאק?</h2>
    <p>
      בשונה מהרגיל אני רואה לנכון לרשום כאן כתבה, משהו יותר מסודר ב״תבנית״, אולי
      מדי כמה חודשים לעדכן אותה כי זו התעשייה, תמיד דברים חדשים יוצאים וצריך
      לעמוד בקצב.
    </p>
    <p>
      אז נתחיל מבראשית, ברכות! ההחלטתם שאתם רוצים להיות מפתחים, בין אם להיכנס
      למדמ״ח בשלוש שנים הקרובות או בוט-קאמפ לחצי שנה, הולך להיות מעניין סך הכל,
      אבל טובים ממני יגידו לכם, זה לא מה שילמד אותכם באמת להיות מפתחים ואני
      בכוונה מנסח את זה ככה, אני לא אומר שזה מה ״שיכניס אתכם להייטק״ כי אני
      לפחות לא למדתי כי רציתי להיכנס להייטק, למדתי כי זה פשוט מגניב.
    </p>
    <p>
      <strong>אז מה זאת אומרת?</strong>
    </p>
    <p>
      פשוט לא יורדים לרזולוציות, לא מגיעים לעומק של כל דבר כי מה לעשות אי אפשר
      לרוץ עם כיתה של ממוצע בין 20 ל-30 תלמידים (תלוי איפה אתם לומדים) על הכל
      מהכל.
    </p>
    <p>
      אישית, ולא שאני מאשים את מוסד הלימודים בו למדתי, להיפך דווקא יחסית לקורס
      שהיה בזמן מלחמה היה בסדר גמור, ואני אומר ומדגיש – אי אפשר להחליף מוסד
      לימודי, יש מרצה שזמין לשאלות ויעזור לכם לדבג את הקוד או ייתן לכם מניסיונו
      בתעשייה, יש כיתה יש אנשים, לומדים לעבוד בצוות ולא להיות בוטים מול מחשב.
      אבל לעניינינו, ממש לא הספיק לי החומר המלומד בכיתה הרגשתי שבשביל לרשום קוד
      איכותי אני צריך להשקיע 300 אחוז בלמידה והעמקה נוספת על כל דבר שלומדים, היו
      כמה כלים שהיו ועדיין לצידי והראשי מבניהם הוא Udemy פלטפורמה המציעה קורסים
      אונליין בכמעט כל דבר, באחד הפוסטים ביקשו ממני לרשום פוסט על טופ הקורסים של
      אחד המרצים מהפלטפורמה, אבל למה להגביל במרצה אחד אם אפשר בעצם לתת את המסלול
      למידה? (פחות כמה קורסים שהיו מאכזבים ולא איכותיים בעיניי)
    </p>
    <p>
      <strong>אז בואו נתחיל!</strong>
    </p>
    <p>
      <strong>(לממהרים, טבלה מסכמת בסוף)</strong>
    </p>
    <h3 style={headingStyles}>ה-Roadmap למפתח פול-סטאק</h3>
    <h4 style={headingStyles}>שלב א׳:</h4>
    <p>
      היסודות, לפני שתיכנסו ליודמי, אני חושב שלפני שמדברים עם המחשב ונותנים לו
      הוראות צריך להבין את המחשב, איך הוא בנוי, איך הוא עובד ומה קורה בתכל׳ס
      בפנים, זה אולי לא ישמע לכם נצרך אבל בעיניי זה מגביל לחובה מוסרית/מקצועית
      (אתם מגיעים לראיון עבודה, לא תחקרו ותבינו עם מי אתם הולכים לדבר? אני חושב
      שהעיקרון הזה גם פה תופס)
    </p>
    <p>
      אז קודם תיכנסו לערוץ יוטיוב הנפלא של{" "}
      <a href="https://www.youtube.com/@PowerCert">PowerCert Animated Videos</a>
      , בערוץ תמצאו מגוון רכב של סרטונים המתעסקים בעולם החומרה, בכללי שימו לערוץ
      עוקב זה מוסבר בשפה ברורה עם אנימציות תלת ממדיות שממש עוזרות ותורמות להבנה,
      אני אישית מנוי יותר מעשור..
    </p>
    <h4 style={headingStyles}>הקדמה להכל – איך בנוי המחשב:</h4>
    <p>
      <a href="https://www.youtube.com/watch?v=d86ws7mQYIg">איך בנוי המחשב</a>
    </p>
    <p>
      <a href="https://youtu.be/1cyMTl_QXSc?si=k2hME061xXjr9tV_">
        כונן קשיח - איפה שמאחסנים את המידע שלכם
      </a>
    </p>
    <p>
      <a href="https://youtu.be/PVad0c2cljo?si=YFrhLfuZFjtjIMdR">
        זיכרון ראם – איפה שהתהליכים נרשמים
      </a>
    </p>
    <p>
      <a href="https://youtu.be/b2pd3Y6aBag?si=-OmZLV28CxW_ULqD">
        לוח האם - איפה שהכל חי וזורם
      </a>
    </p>
    <p>
      <a href="https://youtu.be/UjCDWCeHCzY?si=vg3_SBgigO0anyzu">
        שרתים – איך אנשים מגיעים לאתר שבניתם
      </a>
    </p>
    <p>
      <a href="https://youtu.be/LGz0Io_dh_I?si=qsj9JvwX9PNn_SNf">
        מה זה CMOS, BIOS ו-UEFI
      </a>
    </p>
    <h4 style={headingStyles}>המלצה נוספת לפני שצוללים:</h4>
    <p>
      תרשמו לערוץ היוטיוב של{" "}
      <a href="https://www.youtube.com/@WebDevSimplified">Web Dev Simplified</a>
      , רוב בנושאים שתתקעו עליהם קייל מדבר עליהם בהרחבה והוא על בסיס כמעט
      יומיומי מעלה תוכן זהב!
    </p>
    <p>אחרי שבניתם או חיזקתם הבנה כללית איך המחשב עובד אפשר לגשת לתכלס.</p>
    <h4 style={headingStyles}>קורס 1:</h4>
    <p>
      <a href="https://www.udemy.com/course/the-complete-web-development-bootcamp/">
        The Complete 2024 Web Development Bootcamp
      </a>
      <br />
      מרצה: דר׳ אנג׳לה יו
      <br />
      אורך: 61.5 שעות
    </p>
    <p>
      דר׳ אנג׳לה יו לאורך הקורס ובעיקר בתחילתו נותנת הסברים מעולים להבנה קלה של
      הנושאים הבסיסיים, החל מקצת יסודות למדעי המחשב ובסיס של HTML, CSS, בכללי
      אני אתבסס על הקרוס הזה כ-Roadmap כללי ובחלק מהשלבים יהיו ״עצירות״ להעמקה.
    </p>
    <p>
      <strong>
        עשרת הפרקים הראשונים עוסקים ביסודות ולכן אל תדלגו על אף אחד מאלו.
      </strong>
    </p>
    <p>
      פרק 11 עוסק בספריית עיצוב בשם Bootstrap, הייתי פחות ממליץ להעמיק וללמוד
      אותה, כי היא פשוט זוועתית בעיני אז יותר כדי לסמן וי.
    </p>
    <p>
      פרק 12 נוגע ממש על קצה המזלג בעולם ה-ux/ui, משם אתם יכולים לעשות עצירה (לא
      חובה בכלל, זה יותר המלצה – אני לא הייתי עושה זאת בהכרח אלא אם כן אתם
      מכוונים לעולם של פרונט), ולהעמיק בעולם של עיצוב ממשק וחווית המשתמש, בשביל
      זה יש קורס שאני ממליץ עליו שמעמיק בנושא, אתם מעמיקים בתחום ומקבלים בעיני
      המון כלי, בנוסף לשימוש בתוכנת Figma ועוד המון דברים נחמדים.
    </p>
    <h4 style={headingStyles}>קורס 2 (אופציה):</h4>
    <p>
      <a href="https://www.udemy.com/course/complete-web-designer-mobile-designer-zero-to-mastery">
        Become a UX/UI Designer! Master Mobile and Web Design, User Interface +
        User Experience (UI/UX Design), HTML, and CSS
      </a>
      <br />
      מרצה: צוות ZTM (Zero to Mastery)
      <br />
      אורך: 28 שעות
    </p>
    <p>
      פרק 13 עוסק בפרויקט קייפסטון, ומאוד חשוב לא לדלג עליו, לארוך תהליך הלמידה
      חשוב בסוף ליישם ולעשות דברים לבד ולאו דווקא פשוט לעבוד בשיטת Code Along,
      אולי רשום שתי דקות כי זה הסבר אבל תשקיעו כמה שעות על זה.
    </p>
    <p>
      מכאן אני ממליץ לעשות דילוג קצר לפרק 27 שמדבר על תוכנת Git, זו תהיה קצת
      קפיצה אבל חשוב להתרגל ולעבוד עם ״גיט״ כמה שיותר מוקדם.
    </p>
    <p>
      ממליץ לכם כחלק מהפרק להיכנס לפוסט שלי בנושא:{" "}
      <a href="https://www.linkedin.com/posts/lirone-fitoussi_git-commands-%D7%A4%D7%A7%D7%95%D7%93%D7%95%D7%AA-%D7%92%D7%99%D7%98-activity-7225772495977525248-pzcV?utm_source=share&utm_medium=member_desktop">
        פוסט בנושא Git
      </a>
    </p>
    <p>
      אחרי שיש לכם הבנה בסיסית של בניית אתר ועבודה עם גיט, מגיע החלק של יישום
      נוסף של מה שלמדתם עד עכשיו, ופה אני ממליץ להירשם לאתר בשם פרונט-אנד-מנטור:{" "}
      <a href="https://www.frontendmentor.io/">Frontend Mentor</a>
      <br /> הפלטפורמה הזו מציעה לכם פרויקטים מעוצבים מראש והמטרה שלכם היא פשוט
      ליצור אותם, בצורה הכי פשוטה, אתם מקבלים דוגמאות עיצוב עם הסברים ויעדים
      ומכאן שלכם – אתם צריכים לשחזר את התוצאה, יש שם חלוקה לרמות, כולל או לא
      כולל שפות מסוימות, הייתי ממליץ כחימום לעשות את השלושה ההכי פשוטים בעיניכם
      שדורשים רק HTML ו-CSS, יכול לקחת לכם בין 3 ל-5 שעות לפרויקט, מה שחשוב זה
      לאורך הפרקים הבאים כל יומיים שלוש לעשות עוד פרויקט, תוך כדי תפגשו אתגרי
      עיצוב שיחזקו את יכולת הפרונט שלכם משמעותית, ובכללי תפתחו עין קצת יותר
      עיצובית.
    </p>
    <h4 style={headingStyles}>חוזרים לפרק 14 עד 18:</h4>
    <p>
      שם תלמדו את השפת תכנות האמיתית בכל הסיפור הזה – JavaScript, ולאחר פרק 18
      אנחנו יוצאים לעצירה קטנה (לא לשכוח את הפרויקט קייפסטון, הכל נכנס לתיק
      עבודות ובעיקר לגיט):
    </p>
    <h4 style={headingStyles}>קורס 3:</h4>
    <p>
      <a href="https://www.udemy.com/course/the-complete-javascript-course/">
        The modern JavaScript course for everyone! Master JavaScript with
        projects, challenges and theory. Many courses in one!
      </a>
      <br />
      מרצה: ג׳ונס שמדטמן
      <br />
      אורך: 68.5 שעות
    </p>
    <p>
      אקדים ואומר שאני משוחד, ג׳ונס הוא אחד המרצים המובילים בעיני ביודמי, הוא
      מסביר בצורה ברורה וחדה בליווי דוגמאות ומצגות מדויקות איך הדברים עובדים,
      לאורך הקורס הלא קצר בכלל אתם תלמדו את כל מה שתצטרכו לדעת על JavaScript,
      החל ממשתנים ועד עבודה עם מה שנקרא תכנות מונחה עצמים (OOT).
    </p>
    <p>
      אני ממליץ לרוץ עד פרק 7 - עבודה עם ה-DOM.
      <br /> אחרי הפרק הזה כבר תהיו בעלי שליטה די טובה בבסיס לפיתוח פרונט-אנד עם
      HTML CSS ועכשיו גם JavaScript.
    </p>
    <p>
      החל מפרק 8, אני ממליץ בכל סוף פרק או שניים לשבת על אתגר בפרונט-אנד-מנטור,
      והפעם לשלב גם אתגר גם JavaScript, וככל שתתקדמו, גם תשימו לב שהפרויקטים
      רצים ולוקחים עד 3 שעות, אבל אתם גם תשימו לב שאתם לאט לאט בונים תיק עבודות
      לא רע בכלל.
    </p>
    <p>
      אחרי שסיימתם את פרק 9, אני ממליץ אבל לא חובה לקחת קורס נוסף שמעמיק בנושא
      של מבנה נתונים – Data Structures
    </p>
    <h4 style={headingStyles}>קורס 4 (אופציה):</h4>
    <p>
      <a href="https://www.udemy.com/course/js-algorithms-and-data-structures-masterclass/">
        JavaScript Algorithms and Data Structures Masterclass
      </a>
      <br />
      מרצה: Colt Steele
      <br />
      אורך: 22 שעות
    </p>
    <p>
      הקורס יעמיק יותר בעולם המבנה נתונים וקצת מדעי המחשב בהיבט של JavaScript
      ולמעשה ירחיב ויפרק את הבסיס שלמדת את ג׳ונס.
      <br /> חזרנו לג׳ונס, בשלב הזה אם לקחתם את קורס 4, מלבד ידע מעשי יש לכם גם
      הבנה עמוקה וטובה של מבנה נתונים ואיך לכתוב קוד יעיל, מה שגם מאוד יעזור לכם
      להמשך הקרוס של ג׳ונס שאני ממליץ פשוט להמשיך אותו לפי סדר הפרקים, אם כי
      ג׳ונס גם מציעה מסלול לפי סדרי חשיבות של נושאים, להחלטתכם האישית.
    </p>
    <p>
      ועכשיו חזרנו לאנג׳לה אחרי סיבוב לא קטן בכלל, אנחנו כבר בעלי שליטה חזקה
      מאוד בפיתוח פרונט אבל פרונט ״וונילה״, מכאן אנחנו צוללים לתוך פרק 19,
      jQuery, אתם תצללו בצורה מעמיקה לספריית פרונט רצינית שתקצר לכם בערך שני
      שליש מהקוד שהתרגלתם לרשום עד עכשיו, אבל אל תצללו מעבר למה שיש בפרק כי
      מדובר בספרייה ישנה מאוד וכבר לא ממש בשימוש, בהמשך תבינו מה הספריות
      הרלוונטיות אם כי נחשפתם לזה קצת בקורס של ג׳ונס על JavaScript.
    </p>
    <p>
      אופציה – לדלג רגע לקורס 7 - יסודות על TypeScript אם אתם כבר בשוונג של
      JavaScript.
    </p>
    <h4 style={headingStyles}>פרק 20:</h4>
    <p>
      עוסק בפרויקט אמצע ופרק 21 עוסק בעבודה מול שורת הפקודה, ממליץ כהקדמה לפרק
      21 להיכנס לקרוסלה שלי בנושא:{" "}
      <a href="https://www.linkedin.com/posts/lirone-fitoussi_cli-gui-activity-7231552260177100800-4UWw?utm_source=share&utm_medium=member_desktop">
        קרוסלה בנושא CLI
      </a>
    </p>
    <p>
      וכמובן לפרק מאוד חשוב של Videos PowerCert Animated בנושא:{" "}
      <a href="https://youtu.be/Jfq_BYhxvy0?si=THshkySAtJ7zXDP8">
        PowerCert Animated Video
      </a>
    </p>
    <p>
      בפרק 22 אנג׳לה נכנסת לעולם של פיתוח בק-אנד ולכן הייתי מעדיף להישאר בפרונט,
      לכן נגיע אליו מאוחר יותר, מבטיח.
    </p>
    <p>
      פרק 23 הוא יחסית קריטי, הוא אמנם יותר קשור לבק-אנד אבל מאוד רלוונטי לשלב
      הבא במסע שלכם, לכן תעשו אותו.
      <br /> קופצים לפרק 36, ריאקט, אנחנו צוללים לעולם העמוק של פיתוח פרונט-אנד
      תוך כדי שימוש בטכנולוגיות הרלוונטיות לתעשייה, למה? את זה תגלו תוך כדי הפרק
      הלא קצר בכלל, אבל גם אם הוא נמשך שמונה וחצי שעות זה ממש על קצה המזלג של
      ריאקט ויש עוד כך הרבה מה ללמוד ולהבין ולכן אנחנו יוצאים לסיבוב נוסף וארוך
      מאוד עד שנחזור לאנג׳לה:
    </p>
    <h4 style={headingStyles}>קורס 5:</h4>
    <p>
      <a href="https://www.udemy.com/course/react-the-complete-guide-incl-redux/">
        React - The Complete Guide 2020
      </a>
      <br />
      מרצה: מקסימיליאן שווארצמילר
      <br />
      אורך: 68.5 שעות
    </p>
    <p>
      מקסימיליאן בדומה מאוד לג׳ונס מסביר בצורה מעמיקה, בקצה איטי, עם דוגמאות
      ומלא פרוייקטונים כל נושא לפרטי פרטים הקורס מחולק למספר רק של פרקים ולכן גם
      כאן נצא לסיבובים.
      <br /> אם אתם לחוצים אפשר להתחיל מפרק 31 שם זה קראש-קורס על ריאקט, בשונה
      מאנג׳לה ג׳ונס משתמש בכלי בשם vite.
      <br /> בכל מקרה אם יש לכן זמן נתחיל מפרק 1, מי שמרגיש בשל יכול לדלג ולסמן
      וי על פרק 2 שזה חזרה על JavaScript, מה שיכול להיות ירגיש לכם מיותר אחרי
      הקרוס של ג׳ונס.
      <br /> מה שחשוב אחרי פרק 12 זה קודם כל לעבור לחלקים היותר קשים של
      פרונט-אנד-מנטור והפעם לעשות אותם בעזרת ריאקט, אבל בנוסף זה לחשוב על פרויקט
      אישי שלכם, משהו שאתם תבנו מאפס נושא שאתם תחליטו, אפשר לחפש באינטרנט Front
      End Portfolio Project Ideas יש בשפע.
    </p>
    <p>
      עד פרק 18 אתם תצללו לעומקי ריאקט ורוב הדברים שאפשר לעשות אתו, רק ממליץ לכם
      להיות חדים כי הגרסה החדשה של ריאקט שיוצאת עוד שניה תביא שינוי דרסטי והרבה
      דברים שתלמדו בקורס כנראה יהיו שונים או כבר לא נצרכים אבל אני מאמין
      שמקסימיאלן בהתאם יעדכן את הקורס.
    </p>
    <p>
      מפה אנחנו ממשיכים וצוללים עד לפרק 24 שעוסק בספריית ״טאנסטאק״ או פשוט
      ״ריאקט-קווארי״.
      <br /> מעכשיו עבודה עם פרונט-אנד-מנטור היא בגדר המלצה בלבד כי אתם כבר
      צריכים להיות עסוקים בפרויקטים הרבה יותר רציניים.
      <br /> השורות הבאות הן המלצה אישית והיא אקסטרה-אקסטרה אבל זה בהחלט יכול
      להיות בונוס לארגז הכלים שלכם כמפתחים.
      <br /> יכול להיות וכבר בחרתם שאתם רוצים להיות מפתחי פרונט-אנד, אבל תהיו
      זקוקים בצד שרת, וראיתם את זה קורא פה ושם עד עכשיו, חייב להיות לוגיקה
      מאחורי הקלעים וגם אפשרות לאחסן נתונים, אז אם אתם לא בהכרח תלכו לכיוון של
      פול-סטאק, כדאי לכם ללמוד את טכנולוגיית firebase מבית גוגל, אפשרות שיהיה
      לכם שירות בק אנד מוכן (BaaS) רק להשתמש בספרייה והפקודות, בשביל לצלול היטב
      ולהבין איך להשתמש בה אני ממליץ על הקורס הבא:
    </p>
    <h4 style={headingStyles}>קורס 6:</h4>
    <p>
      <a href="https://www.udemy.com/course/build-an-app-with-react-redux-and-firestore-from-scratch/">
        Build an app with React, Redux and Firestore from scratch
      </a>
      <br />
      מרצה: ניל קאמינגס
      <br />
      אורך: 22.5 שעות
    </p>
    <p>
      הקורס ילווה אתכם בפיתוח פרויקט פרונט אנד תוך כדי שימוש בפיירסטור כבק-אנד.
      שוב זה הכי אקסטרה שהיה עד כה ואפשר לחזור אליו בסוף המסע.
    </p>
    <p>
      לפני שנמשיך לפרק 25 נעשה קפיצה חשובה מאוד לפרק 30, רק תזכורת עד כמה יש
      ונשאר ללמוד על ריאקט כשאנג׳לה נתנה לנו רק 8 וחצי שעות ועכשיו אנחנו מבינים
      כמה זה היה על קצה המזלג.
      <br /> פרק 30 עוסק בשפת TypeScript עם ריאקט, אבל לפני זה אולי כדאי בכלל
      להבין מה זה טייפ-סקריפט (אם לא קפצתם לפה בסוף קורס 3 ברשימה) ולכן נצא לעוד
      סיבוב כפול עם מקסימיליאן:
    </p>
    <h4 style={headingStyles}>קורס 7:</h4>
    <p>
      <a href="https://www.udemy.com/course/understanding-typescript/">
        Understanding TypeScript
      </a>
      <br />
      מרצה: מקסימיליאן שווארצמילר
      <br />
      אורך: 15 שעות
    </p>
    <p>
      לאורך הקורס הזה מקסימיליאן יצלול לעומק בהבנה של TypeScript והדברים שהוא
      מביא אתו, יהיו חלקים מובנים יותר ומובנים פחות וחשוב לזכור שיהיו חלקים
      שכנראה לא תפגשו הרבה בפרט אם לא תלמדו אנגולר מאוחר יותר.
      <br /> אבל זה רק טייפ-סקריפט נכון? מפה אנחנו ממשיכים לסיבוב המשך של ריאקט
      TypeScript...
    </p>
    <p>
      <strong>שימו לב:</strong> אפשר בשלב הזה ישר לגשת לפרק 30 של הקורס ריאקט
      ואפשר גם אחריו, מה שירגיש לכם בנוח.
    </p>
    <h4 style={headingStyles}>קורס 8:</h4>
    <p>
      <a href="https://www.udemy.com/course/react-typescript-the-practical-guide/">
        React & TypeScript - The Practical Guide
      </a>
      <br />
      מרצה: מקסימיליאן שווארצמילר
      <br />
      אורך: 15 שעות
    </p>
    <p>
      בחלק הזה אנחנו ניגע ממש בפרקטיקה של ריאקט עם טייפ-סקריפט, קורס יחסית קצר,
      אז אפשר לרוץ על הכל בלי דילוגים...
    </p>
    <p>
      אחרי הדילוג המהיר לפרק 30, חזרנו לאיפה שהיינו וכעט אנו מגיעים לשלב חדש
      והייתי ממליץ לפני כניסה לפרק 25 שמדבר על מה שהרוב קוראים לו ״הדבר הבא״ –
      Next.js, וניחשתם נכון, לצאת לסיבוב נוסף:
    </p>
    <h4 style={headingStyles}>קורס 9:</h4>
    <p>
      <a href="https://www.udemy.com/course/next-js-the-complete-developers-guide/">
        Next JS: The Complete Developer's Guide
      </a>
      <br />
      מרצה: סטפן גרידר
      <br />
      אורך: 15.5 שעות
    </p>
    <p>
      שלא יעבדו עליכם – Next יושב על React, הוא משפר אותו ונותן לו את כל מה שלא
      מגי מובנה, הוא לא משהו נפרד לחלוטין (יש כמה ״בומרים״ שמשום מה מנסים להשוות
      ביניהם בלי שום היגיון).
      <br /> סטפן מרצה בצורה נעימה, עם הדגמות של תרשימים ממש נחמדות שתורמות
      להבנה ויזואלית של איך דברים עובדים מאחורי הקלעים, ועוד נחזור אליו במסע
      שלנו בנושא אחר.
      <br /> בקורס הזה אין הרבה חוכמות, הוא גם די קצר ולכן פשוט תעשו את כולו לפי
      הסדר.
    </p>
    <p>
      סיימנו סיבוב, אחרי שעשינו הכל בגדול נעשה הכל בקטן עם פרק 25 של מקסימיליאן
      על נקסט, רק שאתם כבר מגיעים מוכנים וזו תהיה יותר כמו סוג של חזרה או סיכום
      של הנושא וגם תצאו עם איזה פרויקט קטן.
      <br /> אנחנו ממשיכים עם מקסימיליאן עד לפרק 29, שעוסק בבדיקות, עכשיו חשוב
      להדגיש בדיקות זה עולם שלם בפני עצמו, תלוי במקום העבודה שאליו תגיעו בין אם
      זה סטארט-אפ קטן או חברה גדולה הדרישה לידע ושליטה בעולם הבדיקה יכולה
      להשתנות, ולכן לא נצלול אל תוך עולם ה-QA אבל כן נעשה שני סיבובים כדי להבין
      את החשיבות של בדיקות.
    </p>
    <p>
      אז לפני פרק 29, נלך לקורס מקדים של מקסימיליאן על יוניט-טסטינג, שימו לב זו
      תהיה צלילה חזרה לג׳אווה סקריפט וונילה אבל זה צעד הכרחי:
    </p>
    <h4 style={headingStyles}>קורס 10:</h4>
    <p>
      <a href="https://www.udemy.com/course/javascript-unit-testing-the-practical-guide/">
        JavaScript Unit Testing - The Practical Guide
      </a>
      <br />
      מרצה: מקסימיליאן שווארצמילר
      <br />
      אורך: 5.5 שעות
    </p>
    <p>
      בקורס המאוד קצר ששווה ערך לפרק, מקסימיליאן צולל וחושף אותנו לבסיס של עולם
      הבדיקות בצורה מדויקת, אמנם פחות פרקטיקה אבל הבנה כללית טובה מה הקטע של
      בדיקות והחשיבות שלהן לאורך תהליך הפיתוח.
      <br /> אחרי הבסיס, אפשר לצלול לפרק 29 עצמו, אבל שימו לב יש עוד סיבוב של
      אחרי:
    </p>
    <h4 style={headingStyles}>קורס 11:</h4>
    <p>
      <a href="https://www.udemy.com/course/react-testing-library-and-jest/">
        React Testing Library and Jest: The Complete Guide
      </a>
      <br />
      מרצה: סטפן גרידר
      <br />
      אורך: 7.5 שעות
    </p>
    <p>
      אמרתי לכם שנחזור אליו 😊 כמו שאמרתי לספטן דרך ייחודית להסביר דברים והוא
      מעמיק קצת יותר בנושא הבדיקות באמצעות React Testing Library.
      <br /> אוקיי, בשלב הזה מלבד ידע בפיתוח גם הוספנו את היכולת של בדיקות
      ומומלץ לאמץ הרגל של בדיקות תוך כדי פיתוח כי יהיו מצבים בעתיד שאוטומציות
      יחסכו לכם הרבה מאוד זמן בשביל לבדוק מערכות מורכות כי לבדוק ולוודא שמשהו
      עובד ידנית על ידי קונסול לוג זה לא הכי מקצועי.
      <br /> את פרק 30 כבר השלמנו ועכשיו עומדים לפנינו שמונה פרקים כאשר חמישה
      מתוכם מקסימיליאן מגדיר כבונוס, אבל תעשו אותם, נטו בשביל השליטה והתעודה של
      סיום קורס.
    </p>
    <p>
      ברכות! סיימתם את החלק הראשון בדרך להיות מפתחי פול-סטאק כאשר שליטה
      בפרונט-אנד נמצאת כעט מאחוריכם! (טוב לא לגמרי, יש מאות ספריות שמחכות לכם
      ואין לדעת מה תהיה הטכנולוגיה המובילה בעוד חמש שנים...)
    </p>
    <p>
      אז חזרנו לאנג׳לה, אנחנו נשלים את פרק 22 שעוסק בהקדמה לבק-אנד וזו הזדמנות
      מעולה להקדים בהבנה של עולם המחשבים עם קצת תוכן של PowerCert Animated
      Videos, שימו לב מדובר בהחלט בנושאים שקשורים לעולם התקשורת, זה אולי לא ממש
      תכנות אבל הבנתם תעזור לכם ותיתן לכם בסיס חזק לפני כניסה לעולם הבק-אנד:
    </p>
    <p>
      <a href="https://youtu.be/ELioaGg4WOY?si=hNDhuRDWMuQ_5_ub">
        איך אי-מייל עובד
      </a>
    </p>
    <p>
      <a href="https://youtu.be/g2fT-g9PX9o?si=cADkau1jZRoZBV1C">
        מה זה פורטים
      </a>
    </p>
    <p>
      <a href="https://youtu.be/NyZWSvSj8ek?si=S_kskgrPE7BwJboX">
        מה זה LAN WAN
      </a>
    </p>
    <p>
      <a href="https://youtu.be/po8ZFG0Xc4Q?si=TbjfY_7toBvBNz8L">
        כתובות איי-פי – פרטי וחיצוני
      </a>
    </p>
    <p>
      <a href="https://youtu.be/po8ZFG0Xc4Q?si=TbjfY_7toBvBNz8L">
        מה זה כתובת מק
      </a>
    </p>
    <p>
      <a href="https://youtu.be/mPMGRILsOVk?si=OGyzXZGRTDv6VV2E">
        ההבדל בין ווי-פיי ל-בלוטוס
      </a>
    </p>
    <p>
      <a href="https://youtu.be/hExRDVZHhig?si=yiA_189qEauBqRDl">
        פרוטוקולי אבטחה
      </a>
    </p>
    <p>
      <a href="https://youtu.be/mpQZVYPuDGU?si=QnS0bWK31ELbPujc">מה זה DNS</a>
    </p>
    <p>
      פרקים 24 עד 31 הם הטעימה הקטנה לפיתוח בק-אנד ויצירת שרתים, עבודה מעמיקה עם
      node.js ועוד המון הפתעות, פרקים 32 ו-33 עוסקים כבר במסדי נתונים אבל בגלל
      שזו רק טעימה, ממש אחרי פרק 33 נצא לשני סיבובים מאוד חשובים:
    </p>
    <h4 style={headingStyles}>קורס 12:</h4>
    <p>
      <a href="https://www.udemy.com/course/sql-and-postgresql/">
        SQL and PostgreSQL: The Complete Developer's Guide
      </a>
      <br />
      מרצה: סטפן גרידר
      <br />
      אורך: 22 שעות
    </p>
    <p>
      הקורס האיכותי ביותר של סטפן כי בתוך מי שמאוד טוב בלהציג גברים עם תרשימים
      היתרון שלו גובר על שאר המרצים באינטרנט כשמדובר בלהסביר מסדי נתונים, אני
      ממליץ לקחת את הקורס הזה לאט לאט כי יש שם ירידה לפרטים ממש קטנים על איך
      הדברים בנויים (ברמה בינארית).
      <br /> אחרי שהשלמנו העמקה והבנה ועבודה עם SQL ובפרט פוסטגרס, אנחנו אמנם לא
      נרים פרויקט מלבד מה שעשינו עם אנג׳לה, מכאן אני ממליץ ללמוד באופן עצמאי (לא
      מצאתי עדיין קורס איכותי) ספריית סקוואלייז (Sequelize), זה משהו שאפשר גם
      ביוטיוב אבל שתכירו, אבל החלק המעניין יותר מגיע עכשיו, אנחנו הולכים לצלול
      עמוק לעולם של node.js עם מי שפגשנו בתחילת הדרך:
    </p>
    <h4 style={headingStyles}>קורס 13:</h4>
    <p>
      <a href="https://www.udemy.com/course/nodejs-express-mongodb-bootcamp/">
        Node.js, Express, MongoDB & More: The Complete Bootcamp
      </a>
      <br />
      מרצה: ג׳ונס שמדטמן
      <br />
      אורך: 42 שעות
    </p>
    <p>
      פרקים 1 עד 6 בקורס הזה מעמיקים בעבודה עם node.js והרבה הבנה תיאורטית על
      איך דברים עובדים ואיך עושים את זה נכון.
      <br /> לפני פרק 7 אפשר לעשות בנפרד או במקביל סיבוב מאוד מעניין:
    </p>
    <h4 style={headingStyles}>קורס 14:</h4>
    <p>
      <a href="https://www.udemy.com/course/mongodb-the-complete-developers-guide/">
        MongoDB - The Complete Developer's Guide 2024
      </a>
      <br />
      מרצה: מקסימיליאן שווארצמילר
      <br />
      אורך: 17.5 שעות
    </p>
    <p>
      כפי שציינתי אפשר לפני או אפשר תוך כדי הקורס של ג׳ונס כל Node.js, פשוט
      מקסימיליאן רץ על פרויקט אחד אז שלא יחסר לכם דברים בתיק עבודות ותהיה לכם
      שליטה וחזרה על הנושא של מונגו.
      <br /> כאשר הגעתם לפרק 10 של הקורס שמדבר עם הזדהות ואבטחה, תעשו איזה קפיצה
      אחורה לאנג׳לה לפרק 35 שגם מדבר על הנושא, רק אחרי זה תחזרו לקורס של ג׳ונס
      עד הסוף ואתם תצאו עם פרויקט node.js מרשים עם שימוש ב-SSR כאשר יש לך שליטה
      בשני שפות בנושא, PUG ו-EJS.
      <br /> את פרק 36 כבר סיימנו כאמור ועכשיו יש לנו שליטה גם בצד לקוח וגם בצד
      שרת, נשאר רק לחבר ביניהם, קחו לעצמכם אתגר ותחשבו על פרויקט שלם שידרוש את
      כל מה שלמדתם לאורך המסע הארוך הזה, ותיישמו אותו, במידה ועדיין יש לכם ספק
      איך בק ופרונט מתחברים הנה לכם סיבוב אחרון למסע הזה:
    </p>
    <h4 style={headingStyles}>קורס 15:</h4>
    <p>
      <a href="https://www.udemy.com/course/react-nodejs-express-mongodb-the-mern-fullstack-guide/">
        React, NodeJS, Express & MongoDB
      </a>
      <br />
      מרצה: מקסימיליאן שווארצמילר
      <br />
      אורך: 19 שעות
    </p>
    <p>
      הקורס הזה יסכם לכם ויעשה לכם סדר איך מפתחים אפליקציית פול-סטאק מא׳ ועד ת׳.
    </p>
    <p>
      חזרנו לחלק האחרון של המסע שהוא בעיניי עדיין לא במקום שהטכנולוגיה מספיק
      נפוצה ונגישה ובעיקר משומשת אבל שווה להיכנס כדי להכיר את עולם הזה של
      קריפטו, DAPP ובלוקצ׳יין.
    </p>
    <p>
      זהו, אני חושב, זה המסלול שאני עשיתי ולמען האמת עדיין עושה, יש כמה קורסים
      שבאופן רשמי עוד לא סיימתי, אבל אני חושב שהשלמת המסע הזה במלואו תביא לכם
      נקודת התחלה מאוד טובה כמפתחי פול-סטאק, בניתם לאורך הדרך תיק עבודות מרשים
      מאוד, למדת לשלוט ברוב הטכנולוגיות הנדרשות היום לפיתוח פול סטאק במיקוד על
      ווב ונשאר לכם רק להמשיך לפתח ולהתפתח!
    </p>
  </div>
);

const Article: React.FC<ArticleProps> = () => {
  const { articleId } = useParams();

  if (articleId === "1") {
    return firstArticleHTML;
  }

  return <div> This is A Future Implementation</div>;
};

export default Article;
